; domain
; This is domain

(define (domain maze)

    (:requirements :typing :fluents :equality :negative-preconditions :conditional-effects)

    (:types 
    
        Locatable Junction Inventory - object
    
        Living Item - Locatable
    
        Player Monster - Living
    
        Box Sword Shield Key Food Gold - Item 
    )
    
    (:predicates 
        ;localisation...
        (atLocation ?x - Locatable ?j - Junction)
    
        ;maze
        (isConnected ?j1 ?j2 - Junction)
        (isLocked ?j1 ?j2 - Junction);if the route is connected, but needs a key to open
        
        ;monster
        (isMonsterDead ?m - Monster)
    
        ;player
        (isPlayerAlive ?p - Player)
    
        ;inventory
        (isInInventory ?x - Item ?i - Inventory)

        (carryItem ?p - person ?item)
        
        (canCarry ?p)
    
    
    )
    
    (:functions 
        (playerHealth) - number
        (playerHunger) - number
        (playerWealth) - number
        (monstersSlain) - number
    
        (maxInventorySize) - number
    
        (inventoryCount) - number
    
        ;how much the food replenishes the hunger bar
        (foodValue ?f - Food) - number
    
        (shieldStrength ?s - Shield) - number
    
        ;how much damage the monster can deal to the player/shield
        (monsterStrength ?m - Monster) - number
    
        ;this could affect how quickly the player gets hungry
        (distanceBetweenJunctions ?j1 ?j2 - Junction) - number
    
    )
     ; this action moves player from location from to location to given that the player is at location from and locations from and to are connected
     ; @parameter player {Living}: the player of the game
     ; @parameter from {junction}: current location of the player
     ; @parameter to {junction}: next location of the player
     (:action goTo
      :parameters (?p - player ?from ?to - Junction)
      :precondition (and (atLocation ?p ?from ) (isConnected ?from ?to) (not (isLocked ?from ?to)))
      :effect (and (atLocation ?p ?to) (not (atLocation ?p ?from)))    
     )

     ; this action makes player able to pick up an item given that player is free 
     ; @parameter player {Living}: the player of the game
     ; @parameter item {Ittem}: the items (Box Sword Shield Key Food Gold) of the game
     ; @parameter j {junction}: current location of the  player and item
     (:action pickUp
      :parameters (?p - player ?i - Item ?j - Junction)
      :precondition (and (atLocation ?p ?j) (atLocation ?i ?j) (canCarry ?p))
      :effect (and (carryItem ?p ?i) (not(atLocation ?i ?j)) (not (canCarry ?p)))
     )

     ; this action makes player able to drop an item given that item and the player is in the same location and player is not free 
      ; @parameter player {Living}: the player of the game
     ; @parameter item {Ittem}: the items (Box Sword Shield Key Food Gold) of the game
     ; @parameter from {junction}: current location of the  player and item
     ; @parameter to {junction}: next location of the player and item
     (:action drop
      :parameters (?p - player ?i - Item ?j - Junction)
      :precondition (and (not(canCarry ?p)))
      :effect  (and (atLocation ?i ?j) (canCarry ?p))
     )
     
     ; this action makes player able to push an item given that item and the player is in the same location and player and item is on the floor 
      ; @parameter player {Living}: the player of the game
     ; @parameter item {Ittem}: the items (Box Sword Shield Key Food Gold) of the game
     ; @parameter from {junction}: current location of the  player and item
     ; @parameter to {junction}: next location of the player and item
     (:action push
      :parameters (?p - player ?i - Item ?from ?to - Junction)
      :precondition (and (atLocation ?p ?from) (atLocation ?i ?from))       
      :effect (and (atLocation ?p ?to) (atLocation ?i ?to) (not(atLocation ?p ?from))
              (not (atLocation ?i ?from)))
     )    
)

; problem
; The aim of this problem is to get to the end point, j10
; This is a visual representation of the map of the maze (arrows denote one way):
;
;       j11
;         ^
;         |
;         |
; j1 --- j2 --- j3 --> j12
;                |      ^
;                |      |
;                |      |
;               j4 --- j5 --- j6 --- j7 --> j13
;                       |             |
;                       |             |
;                     j15 <-- j14 --- j8 --- j9 --- **j10**
;
;

(define (problem problem_big_maze)
(:domain maze)
(:objects
 j1 j2 j3 j4 j5 j6 j7 j8 j9 j10 j11 j12 j13 j14 j15 - Junction
 p - Player
 m - Monster
 i - Inventory
 shield - Shield
 box - Box
 key - Key
 banana - Food
 sword  - Sword
 knife - Knife
)
(:init

    ;Normal Direction
    (isConnected j1 j2)
    (isConnected j2 j3)

    (isConnected j3 j12)
    (isConnected j3 j4)

    (isConnected j4 j5)

    (isConnected j5 j6)
    (isConnected j5 j12)

    (isConnected j6 j7)

    (isConnected j7 j8)
    (isConnected j7 j13)

    (isConnected j8 j9)
    (isConnected j8 j14)

    (isConnected j9 j10)
    (isConnected j14 j15)
    (isConnected j15 j5)

    ;Reverse Direction
    (isConnected j2 j1)
    (isConnected j3 j2)
    (isConnected j4 j3)
    (isConnected j5 j4)
    (isConnected j6 j5)
    (isConnected j7 j6)
    (isConnected j8 j7)
    (isConnected j9 j8)
    (isConnected j10 j9)
    (isConnected j13 j7)
    (isConnected j14 j8)

    ;Locations
    (atLocation p j1)

    ;Player
    (isPlayerAlive p)
)

(:goal  (atLocation p j10))

)

; plan
1. (goto p j1 j2)
   deleted: (atlocation p j1)
   added: (atlocation p j2)
   goals met: 0 of 1
2. (goto p j2 j3)
   deleted: (atlocation p j2)
   added: (atlocation p j3)
   goals met: 0 of 1
3. (goto p j3 j4)
   deleted: (atlocation p j3)
   added: (atlocation p j4)
   goals met: 0 of 1
4. (goto p j4 j5)
   deleted: (atlocation p j4)
   added: (atlocation p j5)
   goals met: 0 of 1
5. (goto p j5 j6)
   deleted: (atlocation p j5)
   added: (atlocation p j6)
   goals met: 0 of 1
6. (goto p j6 j7)
   deleted: (atlocation p j6)
   added: (atlocation p j7)
   goals met: 0 of 1
7. (goto p j7 j8)
   deleted: (atlocation p j7)
   added: (atlocation p j8)
   goals met: 0 of 1
8. (goto p j8 j9)
   deleted: (atlocation p j8)
   added: (atlocation p j9)
   goals met: 0 of 1
9. (goto p j9 j10)
   deleted: (atlocation p j9)
   added: (atlocation p j10)
   goals met: 1 of 1
